name: "InceptionResnet_V1_deploy"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 160 dim: 160 } }
}
layer {
  name: "Conv2d_1a_3x3"
  type: "Convolution"
  bottom: "data"
  top: "Conv2d_1a_3x3"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Conv2d_1a_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Conv2d_1a_3x3"
  top: "Conv2d_1a_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Conv2d_1a_3x3/Scale"
  type: "Scale"
  bottom: "Conv2d_1a_3x3"
  top: "Conv2d_1a_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Conv2d_1a_3x3/Relu"
  type: "ReLU"
  bottom: "Conv2d_1a_3x3"
  top: "Conv2d_1a_3x3"
}

layer {
  name: "Conv2d_2a_3x3"
  type: "Convolution"
  bottom: "Conv2d_1a_3x3"
  top: "Conv2d_2a_3x3"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "Conv2d_2a_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Conv2d_2a_3x3"
  top: "Conv2d_2a_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Conv2d_2a_3x3/Scale"
  type: "Scale"
  bottom: "Conv2d_2a_3x3"
  top: "Conv2d_2a_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Conv2d_2a_3x3/Relu"
  type: "ReLU"
  bottom: "Conv2d_2a_3x3"
  top: "Conv2d_2a_3x3"
}
layer {
  name: "Conv2d_2b_3x3"
  type: "Convolution"
  bottom: "Conv2d_2a_3x3"
  top: "Conv2d_2b_3x3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "Conv2d_2b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Conv2d_2b_3x3"
  top: "Conv2d_2b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Conv2d_2b_3x3/Scale"
  type: "Scale"
  bottom: "Conv2d_2b_3x3"
  top: "Conv2d_2b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Conv2d_2b_3x3/ReLU"
  type: "ReLU"
  bottom: "Conv2d_2b_3x3"
  top: "Conv2d_2b_3x3"
}
layer {
  name: "MaxPool_3a_3x3"
  type: "Pooling"
  bottom: "Conv2d_2b_3x3"
  top: "MaxPool_3a_3x3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Conv2d_3b_1x1"
  type: "Convolution"
  bottom: "MaxPool_3a_3x3"
  top: "Conv2d_3b_1x1"
  convolution_param {
    num_output: 80
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "Conv2d_3b_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "Conv2d_3b_1x1"
  top: "Conv2d_3b_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Conv2d_3b_1x1/Scale"
  type: "Scale"
  bottom: "Conv2d_3b_1x1"
  top: "Conv2d_3b_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Conv2d_3b_1x1/Relu"
  type: "ReLU"
  bottom: "Conv2d_3b_1x1"
  top: "Conv2d_3b_1x1"
}
layer {
  name: "Conv2d_4a_3x3"
  type: "Convolution"
  bottom: "Conv2d_3b_1x1"
  top: "Conv2d_4a_3x3"
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "Conv2d_4a_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Conv2d_4a_3x3"
  top: "Conv2d_4a_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Conv2d_4a_3x3/Scale"
  type: "Scale"
  bottom: "Conv2d_4a_3x3"
  top: "Conv2d_4a_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Conv2d_4a_3x3/Relu"
  type: "ReLU"
  bottom: "Conv2d_4a_3x3"
  top: "Conv2d_4a_3x3"
}
layer {
  name: "Conv2d_4b_3x3"
  type: "Convolution"
  bottom: "Conv2d_4a_3x3"
  top: "Conv2d_4b_3x3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Conv2d_4b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Conv2d_4b_3x3"
  top: "Conv2d_4b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Conv2d_4b_3x3/Scale"
  type: "Scale"
  bottom: "Conv2d_4b_3x3"
  top: "Conv2d_4b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Conv2d_4b_3x3/Relu"
  type: "ReLU"
  bottom: "Conv2d_4b_3x3"
  top: "Conv2d_4b_3x3"
}

#######################


layer {
  name: "block35_1/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "Conv2d_4b_3x3"
  top: "block35_1/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_1/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_1/Branch_0/Conv2d_1x1"
  top: "block35_1/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_1/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block35_1/Branch_0/Conv2d_1x1"
  top: "block35_1/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_1/Branch_0/Conv2d_1x1/Relu"
  type: "ReLU"
  bottom: "block35_1/Branch_0/Conv2d_1x1"
  top: "block35_1/Branch_0/Conv2d_1x1"
}
layer {
  name: "block35_1/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "Conv2d_4b_3x3"
  top: "block35_1/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_1/Branch_1/Conv2d_0a_1x1"
  top: "block35_1/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_1/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_1/Branch_1/Conv2d_0a_1x1"
  top: "block35_1/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_1/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block35_1/Branch_1/Conv2d_0a_1x1"
  top: "block35_1/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block35_1/Branch_1/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_1/Branch_1/Conv2d_0a_1x1"
  top: "block35_1/Branch_1/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_1/Branch_1/Conv2d_0b_3x3"
  top: "block35_1/Branch_1/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_1/Branch_1/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_1/Branch_1/Conv2d_0b_3x3"
  top: "block35_1/Branch_1/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_1/Branch_1/Conv2d_0b_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_1/Branch_1/Conv2d_0b_3x3"
  top: "block35_1/Branch_1/Conv2d_0b_3x3"
}

layer {
  name: "block35_1/Branch_2/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "Conv2d_4b_3x3"
  top: "block35_1/Branch_2/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_1/Branch_2/Conv2d_0a_1x1"
  top: "block35_1/Branch_2/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_1/Branch_2/Conv2d_0a_1x1"
  top: "block35_1/Branch_2/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "block35_1/Branch_2/Conv2d_0a_1x1"
  top: "block35_1/Branch_2/Conv2d_0a_1x1"
}
layer {
  name: "block35_1/Branch_2/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_1/Branch_2/Conv2d_0a_1x1"
  top: "block35_1/Branch_2/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_1/Branch_2/Conv2d_0b_3x3"
  top: "block35_1/Branch_2/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_1/Branch_2/Conv2d_0b_3x3"
  top: "block35_1/Branch_2/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "block35_1/Branch_2/Conv2d_0b_3x3"
  top: "block35_1/Branch_2/Conv2d_0b_3x3"
}
layer {
  name: "block35_1/Branch_2/Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "block35_1/Branch_2/Conv2d_0b_3x3"
  top: "block35_1/Branch_2/Conv2d_0c_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_1/Branch_2/Conv2d_0c_3x3"
  top: "block35_1/Branch_2/Conv2d_0c_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0c_3x3/Scale"
  type: "Scale"
  bottom: "block35_1/Branch_2/Conv2d_0c_3x3"
  top: "block35_1/Branch_2/Conv2d_0c_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_1/Branch_2/Conv2d_0c_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_1/Branch_2/Conv2d_0c_3x3"
  top: "block35_1/Branch_2/Conv2d_0c_3x3"
}
layer {
  name: "block35_1/Concat"
  type: "Concat"
  bottom: "block35_1/Branch_0/Conv2d_1x1"
  bottom: "block35_1/Branch_1/Conv2d_0b_3x3"
  bottom: "block35_1/Branch_2/Conv2d_0c_3x3"
  top: "block35_1/Concat"
}
layer {
  name: "block35_1/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_1/Concat"
  top: "block35_1/Conv2d_1x1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_1/Scale"
  type: "Scale"
  bottom: "block35_1/Conv2d_1x1"
  top: "block35_1/Scale"
  scale_param {
    filler {
      value: 0.17
    }
  }
}
layer {
  name: "block35_1/Sum"
  type: "Eltwise"
  bottom: "block35_1/Scale"
  bottom: "Conv2d_4b_3x3"
  top: "block35_1/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block35_1/Sum/ReLU"
  type: "ReLU"
  bottom: "block35_1/Sum"
  top: "block35_1/Sum"
}
layer {
  name: "block35_2/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_1/Sum"
  top: "block35_2/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_2/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_2/Branch_0/Conv2d_1x1"
  top: "block35_2/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_2/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block35_2/Branch_0/Conv2d_1x1"
  top: "block35_2/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_2/Branch_0/Conv2d_1x1/Relu"
  type: "ReLU"
  bottom: "block35_2/Branch_0/Conv2d_1x1"
  top: "block35_2/Branch_0/Conv2d_1x1"
}
layer {
  name: "block35_2/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_1/Sum"
  top: "block35_2/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_2/Branch_1/Conv2d_0a_1x1"
  top: "block35_2/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_2/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_2/Branch_1/Conv2d_0a_1x1"
  top: "block35_2/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_2/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block35_2/Branch_1/Conv2d_0a_1x1"
  top: "block35_2/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block35_2/Branch_1/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_2/Branch_1/Conv2d_0a_1x1"
  top: "block35_2/Branch_1/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_2/Branch_1/Conv2d_0b_3x3"
  top: "block35_2/Branch_1/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_2/Branch_1/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_2/Branch_1/Conv2d_0b_3x3"
  top: "block35_2/Branch_1/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_2/Branch_1/Conv2d_0b_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_2/Branch_1/Conv2d_0b_3x3"
  top: "block35_2/Branch_1/Conv2d_0b_3x3"
}

layer {
  name: "block35_2/Branch_2/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_1/Sum"
  top: "block35_2/Branch_2/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_2/Branch_2/Conv2d_0a_1x1"
  top: "block35_2/Branch_2/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_2/Branch_2/Conv2d_0a_1x1"
  top: "block35_2/Branch_2/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "block35_2/Branch_2/Conv2d_0a_1x1"
  top: "block35_2/Branch_2/Conv2d_0a_1x1"
}
layer {
  name: "block35_2/Branch_2/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_2/Branch_2/Conv2d_0a_1x1"
  top: "block35_2/Branch_2/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_2/Branch_2/Conv2d_0b_3x3"
  top: "block35_2/Branch_2/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_2/Branch_2/Conv2d_0b_3x3"
  top: "block35_2/Branch_2/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "block35_2/Branch_2/Conv2d_0b_3x3"
  top: "block35_2/Branch_2/Conv2d_0b_3x3"
}
layer {
  name: "block35_2/Branch_2/Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "block35_2/Branch_2/Conv2d_0b_3x3"
  top: "block35_2/Branch_2/Conv2d_0c_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0c_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_2/Branch_2/Conv2d_0c_3x3"
  top: "block35_2/Branch_2/Conv2d_0c_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0c_3x3/Scale"
  type: "Scale"
  bottom: "block35_2/Branch_2/Conv2d_0c_3x3"
  top: "block35_2/Branch_2/Conv2d_0c_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_2/Branch_2/Conv2d_0c_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_2/Branch_2/Conv2d_0c_3x3"
  top: "block35_2/Branch_2/Conv2d_0c_3x3"
}
layer {
  name: "block35_2/Concat"
  type: "Concat"
  bottom: "block35_2/Branch_0/Conv2d_1x1"
  bottom: "block35_2/Branch_1/Conv2d_0b_3x3"
  bottom: "block35_2/Branch_2/Conv2d_0c_3x3"
  top: "block35_2/Concat"
}
layer {
  name: "block35_2/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_2/Concat"
  top: "block35_2/Conv2d_1x1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_2/Scale"
  type: "Scale"
  bottom: "block35_2/Conv2d_1x1"
  top: "block35_2/Scale"
  scale_param {
    filler {
      value: 0.17
    }
  }
}
layer {
  name: "block35_2/Sum"
  type: "Eltwise"
  bottom: "block35_2/Scale"
  bottom: "block35_1/Sum"
  top: "block35_2/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block35_2/Sum/Relu"
  type: "ReLU"
  bottom: "block35_2/Sum"
  top: "block35_2/Sum"
}
layer {
  name: "block35_3/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_2/Sum"
  top: "block35_3/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_3/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_3/Branch_0/Conv2d_1x1"
  top: "block35_3/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_3/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block35_3/Branch_0/Conv2d_1x1"
  top: "block35_3/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_3/Branch_0/Conv2d_1x1/Relu"
  type: "ReLU"
  bottom: "block35_3/Branch_0/Conv2d_1x1"
  top: "block35_3/Branch_0/Conv2d_1x1"
}
layer {
  name: "block35_3/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_2/Sum"
  top: "block35_3/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_3/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_3/Branch_1/Conv2d_0a_1x1"
  top: "block35_3/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_3/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_3/Branch_1/Conv2d_0a_1x1"
  top: "block35_3/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_3/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block35_3/Branch_1/Conv2d_0a_1x1"
  top: "block35_3/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block35_3/Branch_1/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_3/Branch_1/Conv2d_0a_1x1"
  top: "block35_3/Branch_1/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_3/Branch_1/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_3/Branch_1/Conv2d_0b_3x3"
  top: "block35_3/Branch_1/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_3/Branch_1/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_3/Branch_1/Conv2d_0b_3x3"
  top: "block35_3/Branch_1/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_3/Branch_1/Conv2d_0b_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_3/Branch_1/Conv2d_0b_3x3"
  top: "block35_3/Branch_1/Conv2d_0b_3x3"
}

layer {
  name: "block35_3/Branch_2/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_2/Sum"
  top: "block35_3/Branch_2/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_3/Branch_2/Conv2d_0a_1x1"
  top: "block35_3/Branch_2/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_3/Branch_2/Conv2d_0a_1x1"
  top: "block35_3/Branch_2/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "block35_3/Branch_2/Conv2d_0a_1x1"
  top: "block35_3/Branch_2/Conv2d_0a_1x1"
}
layer {
  name: "block35_3/Branch_2/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_3/Branch_2/Conv2d_0a_1x1"
  top: "block35_3/Branch_2/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_3/Branch_2/Conv2d_0b_3x3"
  top: "block35_3/Branch_2/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_3/Branch_2/Conv2d_0b_3x3"
  top: "block35_3/Branch_2/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "block35_3/Branch_2/Conv2d_0b_3x3"
  top: "block35_3/Branch_2/Conv2d_0b_3x3"
}
layer {
  name: "block35_3/Branch_2/Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "block35_3/Branch_2/Conv2d_0b_3x3"
  top: "block35_3/Branch_2/Conv2d_0c_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0c_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_3/Branch_2/Conv2d_0c_3x3"
  top: "block35_3/Branch_2/Conv2d_0c_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0c_3x3/Scale"
  type: "Scale"
  bottom: "block35_3/Branch_2/Conv2d_0c_3x3"
  top: "block35_3/Branch_2/Conv2d_0c_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_3/Branch_2/Conv2d_0c_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_3/Branch_2/Conv2d_0c_3x3"
  top: "block35_3/Branch_2/Conv2d_0c_3x3"
}
layer {
  name: "block35_3/Concat"
  type: "Concat"
  bottom: "block35_3/Branch_0/Conv2d_1x1"
  bottom: "block35_3/Branch_1/Conv2d_0b_3x3"
  bottom: "block35_3/Branch_2/Conv2d_0c_3x3"
  top: "block35_3/Concat"
}
layer {
  name: "block35_3/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_3/Concat"
  top: "block35_3/Conv2d_1x1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_3/Scale"
  type: "Scale"
  bottom: "block35_3/Conv2d_1x1"
  top: "block35_3/Scale"
  scale_param {
    filler {
      value: 0.17
    }
  }
}
layer {
  name: "block35_3/Sum"
  type: "Eltwise"
  bottom: "block35_3/Scale"
  bottom: "block35_2/Sum"
  top: "block35_3/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block35_3/Sum/ReLU"
  type: "ReLU"
  bottom: "block35_3/Sum"
  top: "block35_3/Sum"
}
layer {
  name: "block35_4/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_3/Sum"
  top: "block35_4/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_4/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_4/Branch_0/Conv2d_1x1"
  top: "block35_4/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_4/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block35_4/Branch_0/Conv2d_1x1"
  top: "block35_4/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_4/Branch_0/Conv2d_1x1/Relu"
  type: "ReLU"
  bottom: "block35_4/Branch_0/Conv2d_1x1"
  top: "block35_4/Branch_0/Conv2d_1x1"
}
layer {
  name: "block35_4/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_3/Sum"
  top: "block35_4/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_4/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_4/Branch_1/Conv2d_0a_1x1"
  top: "block35_4/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_4/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_4/Branch_1/Conv2d_0a_1x1"
  top: "block35_4/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_4/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block35_4/Branch_1/Conv2d_0a_1x1"
  top: "block35_4/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block35_4/Branch_1/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_4/Branch_1/Conv2d_0a_1x1"
  top: "block35_4/Branch_1/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_4/Branch_1/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_4/Branch_1/Conv2d_0b_3x3"
  top: "block35_4/Branch_1/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_4/Branch_1/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_4/Branch_1/Conv2d_0b_3x3"
  top: "block35_4/Branch_1/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_4/Branch_1/Conv2d_0b_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_4/Branch_1/Conv2d_0b_3x3"
  top: "block35_4/Branch_1/Conv2d_0b_3x3"
}

layer {
  name: "block35_4/Branch_2/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_3/Sum"
  top: "block35_4/Branch_2/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_4/Branch_2/Conv2d_0a_1x1"
  top: "block35_4/Branch_2/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_4/Branch_2/Conv2d_0a_1x1"
  top: "block35_4/Branch_2/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "block35_4/Branch_2/Conv2d_0a_1x1"
  top: "block35_4/Branch_2/Conv2d_0a_1x1"
}
layer {
  name: "block35_4/Branch_2/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_4/Branch_2/Conv2d_0a_1x1"
  top: "block35_4/Branch_2/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_4/Branch_2/Conv2d_0b_3x3"
  top: "block35_4/Branch_2/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_4/Branch_2/Conv2d_0b_3x3"
  top: "block35_4/Branch_2/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "block35_4/Branch_2/Conv2d_0b_3x3"
  top: "block35_4/Branch_2/Conv2d_0b_3x3"
}
layer {
  name: "block35_4/Branch_2/Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "block35_4/Branch_2/Conv2d_0b_3x3"
  top: "block35_4/Branch_2/Conv2d_0c_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0c_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_4/Branch_2/Conv2d_0c_3x3"
  top: "block35_4/Branch_2/Conv2d_0c_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0c_3x3/Scale"
  type: "Scale"
  bottom: "block35_4/Branch_2/Conv2d_0c_3x3"
  top: "block35_4/Branch_2/Conv2d_0c_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_4/Branch_2/Conv2d_0c_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_4/Branch_2/Conv2d_0c_3x3"
  top: "block35_4/Branch_2/Conv2d_0c_3x3"
}
layer {
  name: "block35_4/Concat"
  type: "Concat"
  bottom: "block35_4/Branch_0/Conv2d_1x1"
  bottom: "block35_4/Branch_1/Conv2d_0b_3x3"
  bottom: "block35_4/Branch_2/Conv2d_0c_3x3"
  top: "block35_4/Concat"
}
layer {
  name: "block35_4/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_4/Concat"
  top: "block35_4/Conv2d_1x1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_4/Scale"
  type: "Scale"
  bottom: "block35_4/Conv2d_1x1"
  top: "block35_4/Scale"
  scale_param {
    filler {
      value: 0.17
    }
  }
}
layer {
  name: "block35_4/Sum"
  type: "Eltwise"
  bottom: "block35_4/Scale"
  bottom: "block35_3/Sum"
  top: "block35_4/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block35_4/Sum/ReLU"
  type: "ReLU"
  bottom: "block35_4/Sum"
  top: "block35_4/Sum"
}
layer {
  name: "block35_5/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_4/Sum"
  top: "block35_5/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_5/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_5/Branch_0/Conv2d_1x1"
  top: "block35_5/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_5/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block35_5/Branch_0/Conv2d_1x1"
  top: "block35_5/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_5/Branch_0/Conv2d_1x1/Relu"
  type: "ReLU"
  bottom: "block35_5/Branch_0/Conv2d_1x1"
  top: "block35_5/Branch_0/Conv2d_1x1"
}
layer {
  name: "block35_5/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_4/Sum"
  top: "block35_5/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_5/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_5/Branch_1/Conv2d_0a_1x1"
  top: "block35_5/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_5/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_5/Branch_1/Conv2d_0a_1x1"
  top: "block35_5/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_5/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block35_5/Branch_1/Conv2d_0a_1x1"
  top: "block35_5/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block35_5/Branch_1/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_5/Branch_1/Conv2d_0a_1x1"
  top: "block35_5/Branch_1/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_5/Branch_1/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_5/Branch_1/Conv2d_0b_3x3"
  top: "block35_5/Branch_1/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_5/Branch_1/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_5/Branch_1/Conv2d_0b_3x3"
  top: "block35_5/Branch_1/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_5/Branch_1/Conv2d_0b_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_5/Branch_1/Conv2d_0b_3x3"
  top: "block35_5/Branch_1/Conv2d_0b_3x3"
}

layer {
  name: "block35_5/Branch_2/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_4/Sum"
  top: "block35_5/Branch_2/Conv2d_0a_1x1"
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_5/Branch_2/Conv2d_0a_1x1"
  top: "block35_5/Branch_2/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block35_5/Branch_2/Conv2d_0a_1x1"
  top: "block35_5/Branch_2/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0a_1x1/Relu"
  type: "ReLU"
  bottom: "block35_5/Branch_2/Conv2d_0a_1x1"
  top: "block35_5/Branch_2/Conv2d_0a_1x1"
}
layer {
  name: "block35_5/Branch_2/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "block35_5/Branch_2/Conv2d_0a_1x1"
  top: "block35_5/Branch_2/Conv2d_0b_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_5/Branch_2/Conv2d_0b_3x3"
  top: "block35_5/Branch_2/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "block35_5/Branch_2/Conv2d_0b_3x3"
  top: "block35_5/Branch_2/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0b_3x3/Relu"
  type: "ReLU"
  bottom: "block35_5/Branch_2/Conv2d_0b_3x3"
  top: "block35_5/Branch_2/Conv2d_0b_3x3"
}
layer {
  name: "block35_5/Branch_2/Conv2d_0c_3x3"
  type: "Convolution"
  bottom: "block35_5/Branch_2/Conv2d_0b_3x3"
  top: "block35_5/Branch_2/Conv2d_0c_3x3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0c_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "block35_5/Branch_2/Conv2d_0c_3x3"
  top: "block35_5/Branch_2/Conv2d_0c_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0c_3x3/Scale"
  type: "Scale"
  bottom: "block35_5/Branch_2/Conv2d_0c_3x3"
  top: "block35_5/Branch_2/Conv2d_0c_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block35_5/Branch_2/Conv2d_0c_3x3/ReLU"
  type: "ReLU"
  bottom: "block35_5/Branch_2/Conv2d_0c_3x3"
  top: "block35_5/Branch_2/Conv2d_0c_3x3"
}
layer {
  name: "block35_5/Concat"
  type: "Concat"
  bottom: "block35_5/Branch_0/Conv2d_1x1"
  bottom: "block35_5/Branch_1/Conv2d_0b_3x3"
  bottom: "block35_5/Branch_2/Conv2d_0c_3x3"
  top: "block35_5/Concat"
}
layer {
  name: "block35_5/Conv2d_1x1"
  type: "Convolution"
  bottom: "block35_5/Concat"
  top: "block35_5/Conv2d_1x1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block35_5/Scale"
  type: "Scale"
  bottom: "block35_5/Conv2d_1x1"
  top: "block35_5/Scale"
  scale_param {
    filler {
      value: 0.17
    }
  }
}
layer {
  name: "block35_5/Sum"
  type: "Eltwise"
  bottom: "block35_5/Scale"
  bottom: "block35_4/Sum"
  top: "block35_5/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block35_5/Sum/ReLU"
  type: "ReLU"
  bottom: "block35_5/Sum"
  top: "block35_5/Sum"
}

#####################

layer {
  name: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  type: "Convolution"
  bottom: "block35_5/Sum"
  top: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Mixed_6a/Branch_0/Conv2d_1a_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  top: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Mixed_6a/Branch_0/Conv2d_1a_3x3/Scale"
  type: "Scale"
  bottom: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  top: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Mixed_6a/Branch_0/Conv2d_1a_3x3/ReLU"
  type: "ReLU"
  bottom: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  top: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block35_5/Sum"
  top: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  top: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  top: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  top: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  type: "Convolution"
  bottom: "Mixed_6a/Branch_1/Conv2d_0a_1x1"
  top: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0b_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0b_3x3/Scale"
  type: "Scale"
  bottom: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_0b_3x3/ReLU"
  type: "ReLU"
  bottom: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
}

layer {
  name: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  type: "Convolution"
  bottom: "Mixed_6a/Branch_1/Conv2d_0b_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_1a_3x3/BatchNorm"
  type: "BatchNorm"
  bottom: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_1a_3x3/Scale"
  type: "Scale"
  bottom: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "Mixed_6a/Branch_1/Conv2d_1a_3x3/ReLU"
  type: "ReLU"
  bottom: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  top: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
}
layer {
  name: "MaxPool_1a_3x3"
  type: "Pooling"
  bottom: "block35_5/Sum"
  top: "MaxPool_1a_3x3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "Mixed_6a/Concat"
  type: "Concat"
  bottom: "Mixed_6a/Branch_0/Conv2d_1a_3x3"
  bottom: "Mixed_6a/Branch_1/Conv2d_1a_3x3"
  bottom: "MaxPool_1a_3x3"
  top: "Mixed_6a/Concat"
}

#####################

layer {
  name: "block17_1/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "Mixed_6a/Concat"
  top: "block17_1/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_1/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_1/Branch_0/Conv2d_1x1"
  top: "block17_1/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_1/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block17_1/Branch_0/Conv2d_1x1"
  top: "block17_1/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_1/Branch_0/Conv2d_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_1/Branch_0/Conv2d_1x1"
  top: "block17_1/Branch_0/Conv2d_1x1"
}
layer {
  name: "block17_1/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "Mixed_6a/Concat"
  top: "block17_1/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_1/Branch_1/Conv2d_0a_1x1"
  top: "block17_1/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block17_1/Branch_1/Conv2d_0a_1x1"
  top: "block17_1/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_1/Branch_1/Conv2d_0a_1x1"
  top: "block17_1/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block17_1/Branch_1/Conv2d_0b_1x7"
  type: "Convolution"
  bottom: "block17_1/Branch_1/Conv2d_0a_1x1"
  top: "block17_1/Branch_1/Conv2d_0b_1x7"
  convolution_param {
    num_output: 128
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0b_1x7/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_1/Branch_1/Conv2d_0b_1x7"
  top: "block17_1/Branch_1/Conv2d_0b_1x7"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0b_1x7/Scale"
  type: "Scale"
  bottom: "block17_1/Branch_1/Conv2d_0b_1x7"
  top: "block17_1/Branch_1/Conv2d_0b_1x7"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0b_1x7/ReLU"
  type: "ReLU"
  bottom: "block17_1/Branch_1/Conv2d_0b_1x7"
  top: "block17_1/Branch_1/Conv2d_0b_1x7"
}
layer {
  name: "block17_1/Branch_1/Conv2d_0c_7x1"
  type: "Convolution"
  bottom: "block17_1/Branch_1/Conv2d_0b_1x7"
  top: "block17_1/Branch_1/Conv2d_0c_7x1"
  convolution_param {
    num_output: 128
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0c_7x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_1/Branch_1/Conv2d_0c_7x1"
  top: "block17_1/Branch_1/Conv2d_0c_7x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0c_7x1/Scale"
  type: "Scale"
  bottom: "block17_1/Branch_1/Conv2d_0c_7x1"
  top: "block17_1/Branch_1/Conv2d_0c_7x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_1/Branch_1/Conv2d_0c_7x1/ReLU"
  type: "ReLU"
  bottom: "block17_1/Branch_1/Conv2d_0c_7x1"
  top: "block17_1/Branch_1/Conv2d_0c_7x1"
}
layer {
  name: "block17_1/Concat"
  type: "Concat"
  bottom: "block17_1/Branch_0/Conv2d_1x1"
  bottom: "block17_1/Branch_1/Conv2d_0c_7x1"
  top: "block17_1/Concat"
}
layer {
  name: "block17_1/Conv2d_1x1"
  type: "Convolution"
  bottom: "block17_1/Concat"
  top: "block17_1/Conv2d_1x1"
  convolution_param {
    num_output: 896
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_1/Scale"
  type: "Scale"
  bottom: "block17_1/Conv2d_1x1"
  top: "block17_1/Scale"
  scale_param {
    filler {
      value: 0.1
    }
  }
}
layer {
  name: "block17_1/Sum"
  type: "Eltwise"
  bottom: "block17_1/Scale"
  bottom: "Mixed_6a/Concat"
  top: "block17_1/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block17_1/Sum/ReLU"
  type: "ReLU"
  bottom: "block17_1/Sum"
  top: "block17_1/Sum"
}
layer {
  name: "block17_2/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block17_1/Sum"
  top: "block17_2/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_2/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_2/Branch_0/Conv2d_1x1"
  top: "block17_2/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_2/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block17_2/Branch_0/Conv2d_1x1"
  top: "block17_2/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_2/Branch_0/Conv2d_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_2/Branch_0/Conv2d_1x1"
  top: "block17_2/Branch_0/Conv2d_1x1"
}
layer {
  name: "block17_2/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block17_1/Sum"
  top: "block17_2/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_2/Branch_1/Conv2d_0a_1x1"
  top: "block17_2/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block17_2/Branch_1/Conv2d_0a_1x1"
  top: "block17_2/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_2/Branch_1/Conv2d_0a_1x1"
  top: "block17_2/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block17_2/Branch_1/Conv2d_0b_1x7"
  type: "Convolution"
  bottom: "block17_2/Branch_1/Conv2d_0a_1x1"
  top: "block17_2/Branch_1/Conv2d_0b_1x7"
  convolution_param {
    num_output: 128
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0b_1x7/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_2/Branch_1/Conv2d_0b_1x7"
  top: "block17_2/Branch_1/Conv2d_0b_1x7"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0b_1x7/Scale"
  type: "Scale"
  bottom: "block17_2/Branch_1/Conv2d_0b_1x7"
  top: "block17_2/Branch_1/Conv2d_0b_1x7"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0b_1x7/ReLU"
  type: "ReLU"
  bottom: "block17_2/Branch_1/Conv2d_0b_1x7"
  top: "block17_2/Branch_1/Conv2d_0b_1x7"
}
layer {
  name: "block17_2/Branch_1/Conv2d_0c_7x1"
  type: "Convolution"
  bottom: "block17_2/Branch_1/Conv2d_0b_1x7"
  top: "block17_2/Branch_1/Conv2d_0c_7x1"
  convolution_param {
    num_output: 128
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0c_7x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_2/Branch_1/Conv2d_0c_7x1"
  top: "block17_2/Branch_1/Conv2d_0c_7x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0c_7x1/Scale"
  type: "Scale"
  bottom: "block17_2/Branch_1/Conv2d_0c_7x1"
  top: "block17_2/Branch_1/Conv2d_0c_7x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_2/Branch_1/Conv2d_0c_7x1/ReLU"
  type: "ReLU"
  bottom: "block17_2/Branch_1/Conv2d_0c_7x1"
  top: "block17_2/Branch_1/Conv2d_0c_7x1"
}
layer {
  name: "block17_2/Concat"
  type: "Concat"
  bottom: "block17_2/Branch_0/Conv2d_1x1"
  bottom: "block17_2/Branch_1/Conv2d_0c_7x1"
  top: "block17_2/Concat"
}
layer {
  name: "block17_2/Conv2d_1x1"
  type: "Convolution"
  bottom: "block17_2/Concat"
  top: "block17_2/Conv2d_1x1"
  convolution_param {
    num_output: 896
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_2/Scale"
  type: "Scale"
  bottom: "block17_2/Conv2d_1x1"
  top: "block17_2/Scale"
  scale_param {
    filler {
      value: 0.1
    }
  }
}
layer {
  name: "block17_2/Sum"
  type: "Eltwise"
  bottom: "block17_2/Scale"
  bottom: "block17_1/Sum"
  top: "block17_2/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block17_2/Sum/ReLU"
  type: "ReLU"
  bottom: "block17_2/Sum"
  top: "block17_2/Sum"
}
layer {
  name: "block17_3/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block17_2/Sum"
  top: "block17_3/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_3/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_3/Branch_0/Conv2d_1x1"
  top: "block17_3/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_3/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block17_3/Branch_0/Conv2d_1x1"
  top: "block17_3/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_3/Branch_0/Conv2d_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_3/Branch_0/Conv2d_1x1"
  top: "block17_3/Branch_0/Conv2d_1x1"
}
layer {
  name: "block17_3/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block17_2/Sum"
  top: "block17_3/Branch_1/Conv2d_0a_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0a_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_3/Branch_1/Conv2d_0a_1x1"
  top: "block17_3/Branch_1/Conv2d_0a_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0a_1x1/Scale"
  type: "Scale"
  bottom: "block17_3/Branch_1/Conv2d_0a_1x1"
  top: "block17_3/Branch_1/Conv2d_0a_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0a_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_3/Branch_1/Conv2d_0a_1x1"
  top: "block17_3/Branch_1/Conv2d_0a_1x1"
}
layer {
  name: "block17_3/Branch_1/Conv2d_0b_1x7"
  type: "Convolution"
  bottom: "block17_3/Branch_1/Conv2d_0a_1x1"
  top: "block17_3/Branch_1/Conv2d_0b_1x7"
  convolution_param {
    num_output: 128
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0b_1x7/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_3/Branch_1/Conv2d_0b_1x7"
  top: "block17_3/Branch_1/Conv2d_0b_1x7"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0b_1x7/Scale"
  type: "Scale"
  bottom: "block17_3/Branch_1/Conv2d_0b_1x7"
  top: "block17_3/Branch_1/Conv2d_0b_1x7"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0b_1x7/ReLU"
  type: "ReLU"
  bottom: "block17_3/Branch_1/Conv2d_0b_1x7"
  top: "block17_3/Branch_1/Conv2d_0b_1x7"
}
layer {
  name: "block17_3/Branch_1/Conv2d_0c_7x1"
  type: "Convolution"
  bottom: "block17_3/Branch_1/Conv2d_0b_1x7"
  top: "block17_3/Branch_1/Conv2d_0c_7x1"
  convolution_param {
    num_output: 128
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0c_7x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_3/Branch_1/Conv2d_0c_7x1"
  top: "block17_3/Branch_1/Conv2d_0c_7x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0c_7x1/Scale"
  type: "Scale"
  bottom: "block17_3/Branch_1/Conv2d_0c_7x1"
  top: "block17_3/Branch_1/Conv2d_0c_7x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_3/Branch_1/Conv2d_0c_7x1/ReLU"
  type: "ReLU"
  bottom: "block17_3/Branch_1/Conv2d_0c_7x1"
  top: "block17_3/Branch_1/Conv2d_0c_7x1"
}
layer {
  name: "block17_3/Concat"
  type: "Concat"
  bottom: "block17_3/Branch_0/Conv2d_1x1"
  bottom: "block17_3/Branch_1/Conv2d_0c_7x1"
  top: "block17_3/Concat"
}
layer {
  name: "block17_3/Conv2d_1x1"
  type: "Convolution"
  bottom: "block17_3/Concat"
  top: "block17_3/Conv2d_1x1"
  convolution_param {
    num_output: 896
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_3/Scale"
  type: "Scale"
  bottom: "block17_3/Conv2d_1x1"
  top: "block17_3/Scale"
  scale_param {
    filler {
      value: 0.1
    }
  }
}
layer {
  name: "block17_3/Sum"
  type: "Eltwise"
  bottom: "block17_3/Scale"
  bottom: "block17_2/Sum"
  top: "block17_3/Sum"
  eltwise_param {  operation: SUM  }
}
layer {
  name: "block17_3/Sum/ReLU"
  type: "ReLU"
  bottom: "block17_3/Sum"
  top: "block17_3/Sum"
}
layer {
  name: "block17_4/Branch_0/Conv2d_1x1"
  type: "Convolution"
  bottom: "block17_3/Sum"
  top: "block17_4/Branch_0/Conv2d_1x1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "block17_4/Branch_0/Conv2d_1x1/BatchNorm"
  type: "BatchNorm"
  bottom: "block17_4/Branch_0/Conv2d_1x1"
  top: "block17_4/Branch_0/Conv2d_1x1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "block17_4/Branch_0/Conv2d_1x1/Scale"
  type: "Scale"
  bottom: "block17_4/Branch_0/Conv2d_1x1"
  top: "block17_4/Branch_0/Conv2d_1x1"
  scale_param {
      bias_term: true
  }
}
layer {
  name: "block17_4/Branch_0/Conv2d_1x1/ReLU"
  type: "ReLU"
  bottom: "block17_4/Branch_0/Conv2d_1x1"
  top: "block17_4/Branch_0/Conv2d_1x1"
}
layer {
  name: "block17_4/Branch_1/Conv2d_0a_1x1"
  type: "Convolution"
  bottom: "block17_3/Sum"
